In [1]:
import pandas as pd

In [2]:
# Load Data
data_dir = '~/data'

weather = pd.read_csv(f'{data_dir}/07-weather-merged.csv')
population = pd.read_csv(f'{data_dir}/08-population-australia-merged.csv')
sunshine = pd.read_csv(f'{data_dir}/07-a-sunshine-merged.csv')

# Rename column in population dataframe
population = population.rename(columns={"State": "regionid"})

# Merge data frames
merged_df = pd.merge(population, weather, on=["regionid", "Date"], how='outer')
merged_df = pd.merge(merged_df, sunshine, on=["regionid", "Date"], how='outer') 

# Sort values
merged_df = merged_df.sort_values(by=["regionid", "Date"])

# Forward fill missing values in Population column within each group
merged_df['population'] = merged_df.groupby('regionid')['population'].ffill()

merged_df.head()

         Date regionid  population  temperature  solar_exposure
0  2009-01-01     NSW1         NaN         35.1        7.555556
1  2009-01-02     NSW1         NaN         23.0        9.500000
2  2009-01-03     NSW1         NaN         23.2        8.916667
3  2009-01-04     NSW1         NaN         27.1        8.750000
4  2009-01-05     NSW1         NaN         31.6        8.888889

In [3]:
weather = pd.read_csv(f'{data_dir}/07-weather-merged.csv')
weather.head()

  regionid  temperature        Date
0     NSW1         35.1  2009-01-01
1     NSW1         23.0  2009-01-02
2     NSW1         23.2  2009-01-03
3     NSW1         27.1  2009-01-04
4     NSW1         31.6  2009-01-05

In [4]:
population = pd.read_csv(f'{data_dir}/08-population-australia-merged.csv')

# Rename column in population dataframe
population = population.rename(columns={"State": "regionid"})

population.head()

         Date regionid  population
0  2009-03-01     NSW1     7385774
1  2009-06-01     NSW1     7408540
2  2009-09-01     NSW1     7435485
3  2009-12-01     NSW1     7459363
4  2010-03-01     NSW1     7488717

In [5]:
sunshine = pd.read_csv(f'{data_dir}/07-a-sunshine-merged.csv')
sunshine.head()

  regionid  solar_exposure        Date
0     NSW1        7.555556  2009-01-01
1     NSW1        9.500000  2009-01-02
2     NSW1        8.916667  2009-01-03
3     NSW1        8.750000  2009-01-04
4     NSW1        8.888889  2009-01-05

In [6]:
# Merge data frames
merged_df = pd.merge(population, weather, on=["regionid", "Date"], how='outer')
merged_df = pd.merge(merged_df, sunshine, on=["regionid", "Date"], how='outer') 
merged_df.head()

         Date regionid  population  temperature  solar_exposure
0  2009-01-01     NSW1         NaN         35.1        7.555556
1  2009-01-02     NSW1         NaN         23.0        9.500000
2  2009-01-03     NSW1         NaN         23.2        8.916667
3  2009-01-04     NSW1         NaN         27.1        8.750000
4  2009-01-05     NSW1         NaN         31.6        8.888889

In [7]:
# Sort values
merged_df = merged_df.sort_values(by=["regionid", "Date"])
merged_df.head()

         Date regionid  population  temperature  solar_exposure
0  2009-01-01     NSW1         NaN         35.1        7.555556
1  2009-01-02     NSW1         NaN         23.0        9.500000
2  2009-01-03     NSW1         NaN         23.2        8.916667
3  2009-01-04     NSW1         NaN         27.1        8.750000
4  2009-01-05     NSW1         NaN         31.6        8.888889

In [10]:
# Forward fill missing values in Population column within each group
merged_df['population'] = merged_df.groupby('regionid')['population'].ffill().bfill()

In [11]:
#Save to csv
merged_df.to_csv(f'{data_dir}/09-temp-pop-merged.csv', index = False)
print("merged and saved to csv")

merged and saved to csv